<template>
    <section class="advantages">
        <h3 class="section-title">Наши преимущества</h3>
        <div class="advantages-list">
            <div class="advantages-list__item" v-for="item in advantages" :key="item">
                <svg class="advantages-list__item-icon" width="70" height="70" viewBox="0 0 70 70" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M23.3537 6.95625C19.1869 8.10461 15.0484 9.35331 10.9419 10.7013C10.5669 10.8227 10.2336 11.0471 9.97985 11.3487C9.72614 11.6504 9.56226 12.0172 9.50687 12.4075C7.08312 30.5944 12.6831 43.8638 19.3637 52.605C22.1922 56.343 25.5649 59.636 29.3694 62.3744C30.8831 63.4419 32.2219 64.2119 33.2762 64.7063C33.8012 64.9556 34.23 65.1219 34.5581 65.2225C34.7016 65.2728 34.8496 65.3095 35 65.3319C35.1486 65.3077 35.295 65.2711 35.4375 65.2225C35.77 65.1219 36.1987 64.9556 36.7237 64.7063C37.7737 64.2119 39.1169 63.4375 40.6306 62.3744C44.435 59.6359 47.8077 56.3429 50.6362 52.605C57.3169 43.8681 62.9169 30.5944 60.4931 12.4075C60.4382 12.0171 60.2745 11.65 60.0207 11.3482C59.767 11.0465 59.4334 10.8223 59.0581 10.7013C56.21 9.76938 51.4019 8.25125 46.6462 6.96062C41.79 5.64375 37.3231 4.66813 35 4.66813C32.6812 4.66813 28.21 5.64375 23.3537 6.96062V6.95625ZM22.19 2.45C26.9369 1.15938 31.9812 0 35 0C38.0187 0 43.0631 1.15938 47.81 2.45C52.6662 3.7625 57.5619 5.31562 60.4406 6.25625C61.6442 6.65372 62.7113 7.38266 63.5192 8.35932C64.3272 9.33597 64.8432 10.5207 65.0081 11.7775C67.6156 31.3644 61.565 45.8806 54.2237 55.4837C51.1107 59.5918 47.3987 63.2094 43.2119 66.2156C41.7641 67.2559 40.2302 68.1707 38.6269 68.95C37.4019 69.5275 36.085 70 35 70C33.915 70 32.6025 69.5275 31.3731 68.95C29.7697 68.1707 28.2358 67.2559 26.7881 66.2156C22.6014 63.2093 18.8894 59.5917 15.7762 55.4837C8.43499 45.8806 2.38437 31.3644 4.99187 11.7775C5.15675 10.5207 5.67281 9.33597 6.48075 8.35932C7.2887 7.38266 8.35577 6.65372 9.55937 6.25625C13.7383 4.88604 17.9498 3.61692 22.19 2.45Z" fill="#FF9A0D"/>
                    <path d="M47.4862 22.5138C47.69 22.717 47.8516 22.9583 47.9619 23.2241C48.0721 23.4899 48.1289 23.7748 48.1289 24.0625C48.1289 24.3502 48.0721 24.6351 47.9619 24.9009C47.8516 25.1667 47.69 25.4081 47.4862 25.6113L34.3612 38.7363C34.158 38.94 33.9166 39.1016 33.6509 39.2119C33.3851 39.3221 33.1002 39.3789 32.8125 39.3789C32.5248 39.3789 32.2399 39.3221 31.9741 39.2119C31.7083 39.1016 31.4669 38.94 31.2637 38.7363L24.7012 32.1738C24.4979 31.9704 24.3365 31.7289 24.2264 31.4632C24.1164 31.1974 24.0597 30.9126 24.0597 30.625C24.0597 30.3374 24.1164 30.0526 24.2264 29.7868C24.3365 29.5211 24.4979 29.2796 24.7012 29.0763C24.9046 28.8729 25.1461 28.7115 25.4118 28.6015C25.6775 28.4914 25.9624 28.4347 26.25 28.4347C26.5376 28.4347 26.8224 28.4914 27.0882 28.6015C27.3539 28.7115 27.5954 28.8729 27.7987 29.0763L32.8125 34.0944L44.3887 22.5138C44.5919 22.31 44.8333 22.1484 45.0991 22.0381C45.3649 21.9279 45.6498 21.8711 45.9375 21.8711C46.2252 21.8711 46.5101 21.9279 46.7759 22.0381C47.0416 22.1484 47.283 22.31 47.4862 22.5138Z" fill="#FF9A0D"/>
                </svg>
                <h5 class="advantages-list__item-title">{{ item.title }}</h5>
                <p class="advantages-list__item-description">{{ item.description }}</p>
            </div>
        </div>
    </section>
</template>

<script>
    export default {
        setup(){
            const advantages = [
                {
                    title: "опыт",
                    description: "Много лет специализируемся на внутреннем туризме"
                },
                {
                    title: "онлайн",
                    description: "Бронирование онлайн, интуитивно понятный интерфейс"
                },
                {
                    title: "надежность",
                    description: "Мы отвечаем за ваш отдых на каждом этапе"
                },
                {
                    title: "доверие",
                    description: "Ежегодно нам доверяют организацию своего отдыха большое количество людей"
                },
            ];

            return {
                advantages
            }
        }
    }
</script>

<style lang="scss" scoped>
    .advantages{
        width: min(100%, 1728px);
        margin-inline: auto;
        padding: 3.125rem 0;
        &-list{
            width: min(100%, 1024px);
            margin-inline: auto;
            padding: 3.125rem 0;
            display: flex;
            justify-content: space-around;
            align-items: center;
            flex-wrap: wrap;
            &__item{
                width: min(90%, 200px);
                display: flex;
                flex-direction: column;
                align-items: center;
                height: 300px;
                margin: 1rem;
                &-icon{
                    margin-bottom: 2rem;
                }
                &-title{
                    font: {
                        size: 2.25rem;
                        weight: 700;
                    }
                    text-transform: uppercase;
                    margin-bottom: 2rem;
                }
                &-description{
                    text-align: center;
                    font-size: 1.125rem;
                    flex-grow: 2;
                }
            }
        }
    }
</style>